:PROPERTIES:
:ID:       850d790d-82a6-4a2f-8a4d-e383571cba23
:END:
#+title: Public Scripts Repository
#+created: 2023-09-18 16:48:01
#+date: 2023-09-18 16:48:01
#+category: Repository:
#+filetags: :Project:Public Scripts Repository:Active:

** Check and Clone repository cli
#+name: Check and Clone repository cli
#+begin_src shell
if [ ! -d "$HOME/Public_Scripts" ]; then gh repo clone GaurAfro/public-scripts ~/public-scripts && echo "Cloned the repository Public Scripts" || echo "Public Scripts Did not get cloned"; else echo "Repository Public Scripts Was Already On Your System"; fi
#+end_src

#+RESULTS: Check and Clone repository cli
: Repository Public Scripts Was Already On Your System

** Check and Clone repository ssh
#+name: Check and Clone repository ssh
#+begin_src shell
if [ ! -d "$HOME/Public_Scripts" ]; then git clone git@github.com:GaurAfro/public-scripts.git ~/public-scripts && echo "Cloned the repository Public Scripts" || echo "Public Scripts Did not get cloned"; else echo "Repository Public Scripts Was Already On Your System"; fi
#+end_src

#+RESULTS: Check and Clone repository ssh
: Repository Public Scripts Was Already On Your System

** Check and Clone repository https
#+name: Check and Clone repository https
#+begin_src shell
if [ ! -d "$HOME/Public_Scripts" ]; then git clone https://github.com/GaurAfro/Public_Scripts ~/Public_Scripts && echo "Cloned the repository Public Scripts" || echo "Public Scripts Did not get cloned"; else echo "Repository Public Scripts Was Already On Your System"; fi
#+end_src

#+RESULTS: Check and Clone repository https
: Repository Public Scripts Was Already On Your System

